app/Controllers/Contact.php

    public function store()
    {
        $contactModel = new ContactModel();

        $data = [
            'name'    => $this->request->getPost('name'),
            'email'   => $this->request->getPost('email'),
            'subject' => $this->request->getPost('subject'),
            'message' => $this->request->getPost('message'),
        ];

        $contactModel->save($data);
---
INSERT INTO `contacts` (`name`, `email`, `subject`, `message`, `created_at`, `updated_at`) VALUES ('Siti Sarah', 'ssarshine@gmail.com', 'hallo', 's', '2024-05-28 13:21:13', '2024-05-28 13:21:13')